[
    "Zuesyo, 12 Feb 2024Please tell me I can answer a WhatsApp phone call with bluetooth buds now.You can actually",
    "Anonymous, 22 Feb 2024I dont see any comment in the review about the smoothness and performance of the software whic... moreHonestly I would have preferred this phone to ship with ColorOS instead like it does in China and like all the Oppo phones have. OxygenOS has always been behind.\n \r\nThe only way I would own a OnePlus 12 is if I order it from China and request the seller to not install OxygenOS on it.",
    "jahiszuhi, 28 Mar 2024isnt there esim??it is listed on the spec sheet.\r\nin global eu version it has esim",
    "Rush, 22 Mar 2024No eSIM as advertised.\r\nShame on you OnePlus! isnt there esim??it is listed on the spec sheet.\n",
    "WiZi, 23 Feb 2024For me, it's the opposite. After a few years of using oneplus, even the new OxygenOS (now... moreOxygen 14 needs big improvements. On Oneplus 12 If you switch apps and return to web browser (google chrome or similar) there is 1-2 seconds delay for the page to load. If you scroll on system launcher there is 1-2 seconds delay after scrolls which results into software unresponsiveness if you scroll/touch quickly. If you take a photo the processing takes 1-2 seconds longer. If you scroll in settings and need to touch on search menu to write a keyword, there is a delay of 1-2 seconds. Sometimes in google chrome there is stuttering or lag. Not sure how the phone would perform with such software if it did not wear the quickest chipset in the market and 16gb ram.. Also I am not sure how many months OP need to resolve all these annoying bugs. I feel like I use a cheap phone with this software. ",
    "Enthusiast, 07 Mar 2024As a proud owner of OnePlus 11 which is loaded with features and power as well as 5 years of O... moreit's 4 OS upgrades and 5 years of security updates",
    "No eSIM as advertised. \r\nShame on you OnePlus! ",
    "As a proud owner of OnePlus 11 which is loaded with features and power as well as 5 years of OS and security updates, the OnePlus 12 is all of that and more which is saying a lot. I Am sold on OnePlus.",
    "Why does the pictures look different in gallery app and google photos \r\nI thought Google Photos supports Proxdr",
    "WiZi, 23 Feb 2024For me, it's the opposite. After a few years of using oneplus, even the new OxygenOS (now... moreComparing a 2-3 year older software to the most recent colorOS is useless. Obviously ColorOS will be smoother and basically better in every way other than looks (which is completely subjective and can be argued either way)\n",
    "WiZi, 23 Feb 2024For me, it's the opposite. After a few years of using oneplus, even the new OxygenOS (now... moreFor someone that uses oneplus for years the UI might feel good however someone who's coming from a very quick UI, can feel some difference to the worse. ",
    "Anonymous, 22 Feb 2024I dont see any comment in the review about the smoothness and performance of the software whic... moreFor me, it's the opposite. After a few years of using oneplus, even the new OxygenOS (now actually ColorOS) seems very smooth to me. The animations are slower, but they look good. And they can be sped up at any time in the developer settings.\n \r\nThe only problem with 16gb ram is that it can handle having so many apps open in the background that it can greatly affect battery drain if apps are not closed.",
    "I dont see any comment in the review about the smoothness and performance of the software which to my opinion is really poor. Great device but Oxygen 14 looks slow to me with poor responsiveness. High end chipset and 16 giga ram are useless if software is crap",
    "Me, 03 Feb 2024The device has already had 2 major updates since release including one just for the camera, mo... moreThe bad thing with oneplus is that they are not solving the software issues with their updates. You still see several issues reported by users since Android 12. The oxygen launcher once upon a time was the best in the market and has become really heavy with bloatware and bugs. Users report same to 1+ but constantly ignored. ",
    "dbizzle, 13 Feb 2024Yes, you can swap lenses when recording in 4K30 and under. Why curved display? I guess to stay... moreThe regular Oppo Find x7 allows you to switch between all rear lenses at 4k60fps so would be surprising if the ultra can't do this",
    "Samik, 13 Feb 2024Why such a HUGE curved display? Also can the user switch lenses DURING video recording?Because of the demand.\n \r\nTo be honest I prefer a smaller flat screen. ",
    "Zuesyo, 12 Feb 2024Please tell me I can answer a WhatsApp phone call with bluetooth buds now.Is this possible with any mobile phone? I am using other phones as well and cannot respond on whatsapp or viber calls directly from the buds with any of them and it sounds reasonable.",
    "Samik, 13 Feb 2024Why such a HUGE curved display? Also can the user switch lenses DURING video recording?Yes, you can swap lenses when recording in 4K30 and under. Why curved display? I guess to stay different. There are people who like the look and feel of them..",
    "Why such a HUGE curved display? Also can the user switch lenses DURING video recording?",
    "Please tell me I can answer a WhatsApp phone call with bluetooth buds now.",
    "Anonymous, 07 Feb 2024I think I figured out the low geekbench scores.\r\n\r\nOneplus turns on Ram Expander by default.  ... moreFirst of all, thanks for your comment, I was wondering if anyone knew the reason and you're the first one with an answer. \r\nThis makes a lot of sense, but it's a bit unfortunate that \r\n1) it's enabled by default, 12Gs should be plenty. \r\n2) the OS should prioritize hardware memory over virtual memory, specially for foreground apps. \r\nThat being said, I feel like for me, I can just disable it and be confident now, thanks again:) ",
    "Fisherman, 08 Feb 2024Yeah they definitely seemed to have rushed this review out. Missing a lot of details.I'm confused about master mode, I though \"original photo mode\" had Hasselblad tuning \r\nbut they released Master which I quote \"The Master Mode features Hasselblad color tuning to enhance the photos with natural and vibrant colors\" . \r\nIt would mean photo mode is OP tuning and Master Mode is Hasselblad's? \r\nWhat does vignette do?\n\n",
    "dbizzle, 08 Feb 2024Also add in portrait mode shots! Feels like they rushed this one out a little..Yeah they definitely seemed to have rushed this review out. Missing a lot of details.",
    "The last paragraph about an Iphone 15 plus costing the same in the US is terribly misleading. An Iphone 15 plus starts at $899 for the 128gb model, if you want equivalent storage (although maybe extreme) or just a step up from that you're right at $999-$1199. Not apples to apples at all.",
    "Fisher, 08 Feb 2024Any chance we could get an updated camera review now that the master mode has been launched?Also add in portrait mode shots! Feels like they rushed this one out a little..",
    "Any chance we could get an updated camera review now that the master mode has been launched?",
    "I think I figured out the low geekbench scores.\n \r\nOneplus turns on Ram Expander by default.  Straight out of the box, it is set at 4GB of extra-slow memory.\n \r\nTurn off Ram Expander (it's hidden under the \"about phone\" menu for some reason... thanks OnePlus...), turn on Performance Mode, and the scores go back to normal.  ~2250 Single core and ~6800 multicore",
    "Its Selfi camera at night vision is not good.. they give 32Mp camera. But in night vision. the selfi result is not good... \r\nPlease check the selfi camera before purchase...\n",
    "dexton, 04 Feb 2024yes keeping a 6.8\" phone in your pocket is a pain. Once you're actually using it tho... moreYou say tomato, he says tomatho. In the end does a 20.9 really matter as to 19.5.9? Would us plain ole folk out here in the real world really notice. And if that answers no, why does it matter to  you guys? Tomatos taste an awful lot like tomathos",
    "Aierlan, 03 Feb 2024BBK is no longer a company. In any case they never made phones. It was just a holding company ... moreHe meant BBC. I think he's on the wrong forum. God at least I hope. And hope that I'm not on the wrong site",
    "Scared? How cute.",
    "Me, 03 Feb 2024Let's be serious mate for all you said..\r\n\r\n1... it's lighter than the S24 Ultra\r\n2.... moreOh no.. you misunderstood. Mate, ehere did I compare it with anyother phone or s24 ultra? I am not saying that it is not a great phone, but what would have made it a perfect phone. The flat screen and the overall size is of course a personal preference, but look at all the comments here itself and it is obvious that people prefer bit smaller phones. May be not as small as 6binch but possibly between 6.3 to 6.5 inch. And the curved screen - it is an out dated design in the first place and secondly there are disadvantages for curved screen over flat screen and that includes accidental touch while holding the phone and using media and the exposed edges being more prone to accidental damage.",
    "I kind of like it,but i'll never get a 7 inch heavy brick.\n",
    "Anonymous, 29 Jan 2024Make a smaller phone for Christ sake. 6.8? This is ugly big.  yes keeping a 6.8\" phone in your pocket is a pain. Once you're actually using it though, it's amazing with a big screen. \n \r\nif your phone is in your pocket 95% of the time, go for a smaller 6-6.3\" screen \r\nif your phone is in your pocket 50% of the time, go for the biggest screen (6.5-6.8\")\n \r\nalso a 20:9 phone will fit better in pocket than a 19.5:9 phone. But offer less width which is great when watching a webpage for example.",
    "jiyen235, 03 Feb 2024bruh I'm FOR BBK phones, I just wish  they released these phones 2-3 months late and had ... moreBBK is no longer a company. In any case they never made phones. It was just a holding company before it was deregistered. This is therefore not a BBK phone ",
    "Me, 03 Feb 2024The device has already had 2 major updates since release including one just for the camera, mo... moreI have seen several reviews and camera samples in which I evaluated the camera (especially the wide and night modes) as well as the video recording to be really average for a high-end device. Has the camera output been improved since these recent updates? ",
    "Me, 03 Feb 2024You do know it's lighter than what I assume is your beloved S24 Ultra and unlike that pho... moreI am looking for a loptop with weight of around 250g for years. You have anything to propose? Lol. Look around almost all 6.70 inches high end devices weigh around 210-230gram. Xiaomi 14 pro, Samsung S24 plus, Vivo x100 pro, Honor Magic pro, iphone 15 pro max and many others...",
    "Me, 03 Feb 2024The device has already had 2 major updates since release including one just for the camera, mo... morebruh I'm FOR BBK phones, I just wish  they released these phones 2-3 months late and had all these bugs fixed because reviews are putting them in a bad spotlight. These reviewers aren't \"real\" reviewers because they just either get paid or \"have to\" do the reviews for clicks, unless they're biased towards it there's no passion or dedication to updating reviews or having a \"trying X phone again\". Only thing people can do nowadays is just toss a coin and choose a phone they want. Reviews aren't helpful anymore.",
    "jiyen235, 26 Jan 2024ahh yeah exactly man, I'm thinking it's a software thing like there have been a few ... moreThe device has already had 2 major updates since release including one just for the camera, more to come. Maybe you should test with those updates before criticising the device further\n",
    "dexton, 28 Jan 2024My Nokia N8 had a small blurry area somewhere in the frame (forgot where), could easily be see... moreEvery device, every brand can have a flaw. As you said, test when you get them, if there's an issue return for a replacement. Sounds pretty simple to me\n",
    "Dgg, 28 Jan 2024220g!  I AM OUT. laptop?You do know it's lighter than what I assume is your beloved S24 Ultra and unlike that phone feels so much smaller and lighter in hand...",
    "Varyar, 02 Feb 2024It would have been a perfect phone if\r\n1. Ut wasn't as bulky as it is now. May be about 6... moreLet's be serious mate for all you said..\n \r\n1... it's lighter than the S24 Ultra \r\n2... The screen is better than the S24 Ultra, it feels much better in hand and is a delight to use even one handed.Sorry buddy, you may prefer a flat screen but you really shouldn't because there really is no benefit of a flat screen over this one.  \r\n3... It runs much cooler when gaming with no skipped frames.\n \r\nBuddy just face it, it's better in so many ways at a fraction of the price. This is RTHE handset to beat right now, and Samsung aren't the ones to do that with there boring flat slab if metal and glass with no character or personality at all. It really is no competition...",
    "Anonymous, 02 Feb 2024S23 Ultra is more serious phoneNo buddy, it's not. \r\nThe whole S23 range is substandard and sadly lacking when compared to the OnePlus 12.\n \r\nThe S24 can't compete. \r\nThe S24 Plus can't compete.\n \r\nI can't argue with The S24 ultra but even that device is bettered in many areas and at a much better price point \n\n",
    "I hope OnePlus will release the new Hasselblad app for other models. ",
    "glitchyy, 01 Feb 2024Should I get this or Samsung s23 ultra ??S23 Ultra is more serious phone",
    "Anonymous, 27 Jan 2024It's unbelievable that in 2024 there are still such extreme differences when it comes to ... moreI don't think it's just the demosaiquing algorithm, but AI perfectly applied.  \r\nWith the Snapdragon 8 gen 3 allowing a strong generative AI a lot of phones are making use of it, of course it looks amazing because it has a lot of information to work with, but I guess some brands don't really give too much importance. \n\n",
    "It would have been a perfect phone if \r\n1. Ut wasn't as bulky as it is now. May be about 6.5inch display with under 160cm height \r\n2. No curved display as it is only a fancy one that reduces longevity and usability. \r\n3. A better design for the back of the phone and the camera island. \n\n \r\nThe renadged colour os is a disappointment but the other three mentioned above are deal-breakers",
    "glitchyy, 01 Feb 2024Should I get this or Samsung s23 ultra ??This is better than I phone 15 promax ",
    "Should I get this or Samsung s23 ultra ??",
    "Why must they continue to make phones so slippery. Some of us don't like cases. I'll buy a new phone if I break it",
    "6.8 is a good size in my opinion...the gripe I have is why curve the screen when tempered glass protectors are impossible to fit to them?  I am struggling to find a curved tempered glass protector for my Xiaomi Mi 11 and I was considering buying this phone but have decided against it solely due to this problem  if anyone has found a solution, I would love to hear about it.",
    "Anonymous, 30 Jan 2024Why does the screen keep getting bigger? What good does that do to ease of handling or battery... moreThat is why they make a foldable phone. Cheers!",
    "Anonymous, 30 Jan 2024Why does the screen keep getting bigger? What good does that do to ease of handling or battery... moreVery well said and valid point. Anything bigger than 6.5 inches is a difficult brick to handle. Ideal size would be 6.3 to 6.5 inches that has a size less than 150mm x 74mm  to 160mm x 75mm ",
    "Why does the screen keep getting bigger? What good does that do to ease of handling or battery performance? If I want a tab I'll buy a tab. They don't even make functional pockets for women yet. How are we supposed to use this phone? ",
    "Make a smaller phone for Christ sake. 6.8? This is ugly big.  ",
    "Disappointed, 28 Jan 2024Your Geekbench 6 benchmark results are wrong. Snapdragon 8 Gen 3 cannot score less that 8 Gen ... moreIt's not wrong.  At least 3 other publications got the same results.  OxygenOS is buggy.",
    "220g!  I AM OUT. laptop?",
    "jiyen235, 23 Jan 2024The display's abysmally low brightness (for being a flagship category phone) is a huge co... moreBBK does not exist anymore. It is no longer a company since April 2023",
    "Your Geekbench 6 benchmark results are wrong. Snapdragon 8 Gen 3 cannot score less that 8 Gen 2 and awful Google Tensor. Please fix it",
    "Aierlan, 25 Jan 2024I've bought two phones that had lens flaws in the past.  I would always return it also as... moreMy Nokia N8 had a small blurry area somewhere in the frame (forgot where), could easily be seen. I didn't return that phone since the blurry area was very small (not like third of the frame like with the Oneplus 12 tele camera).\n \r\nOut of all my Samsungs it hasn't happened yet. S4 Mini, S6, S8+, Note 10, S22 and S23 Ultra. No lens defects in 6 phones. Quite good. Also no other defects on any of those 6 phones. Had an LG V30 between S8+ and Note 10, it had a defective selfie camera. It was a fix focus lens but was focused was somewhere up in the roof like 2-3 meters from the phone. Rarely take selfies but I had it serviced so it wouldn't affect resale value when I sold it.\n \r\nIt's a good idea to test all lenses these days because one phone have so many cameras. ",
    "In the video \"4K 2160p 30fps (telephoto camera, 3x) - OnePlus 12 low-light video sample\" you can see the internal reflections of the bright headlights floating across the top of the screen.\n \r\nI dislike that a lot, and there's no reason to believe that it (internal lens reflections) doesn't occur during the daylight videos; just that it's more difficult to see.\n \r\nThat ruins an otherwise excellent nighttime performance.",
    "I love Chinese e waste phones with flashy spec and 3 years of \"updates\" that does almost nothing. I wonder if my city is still in the middle of the ocean on Xiaomi's world clock map.\n",
    "It's unbelievable that in 2024 there are still such extreme differences when it comes to demosaicing Quad Bayer Sensors. The difference at 2x between the OnePlus 12 and Vivo X100 Pro is huge even though both main cameras deliver the same number of pixels per object. \r\nThe demosaicing algorithm of the Oneplus 12 at 2x is one of the worst Quad Bayer demosaicing algorithms I have seen, though I have seen other bad results some years ago. \r\nIt shows again that the color filter array can have a huge impact on the image quality, if the manufacturer doesn't have the right algorithms.",
    "Aierlan, 26 Jan 2024This screen is definitely better than the ones on the Vivo x100 pro and Iqoo 12. Lots of Chine... moreahh yeah exactly man, I'm thinking it's a software thing like there have been a few Find X7 Ultra comparisons online but that phone got a huge update for basically everything recently. So I'm guessing Oneplus needs an update too. Vivo got an update for 4k selfie vids. Seems like BBK kind of rushed their products.",
    "Nick Tegrataker, 26 Jan 2024That's a really nice piece of information, I appreciate it. I didn't know they had a... moreYeah.   And still some ppl doubt exmor T makes difference.  \r\nAs you see info posted by the other reader, numbers show about 50% higher value compared to exmor RS of same size. ",
    "mr stoosh, 26 Jan 2024So I'm assuming the higher FWC figure that the OnePlus Open LYT-T808 has is technically b... moreYes. \n \r\nLYT - T808 is exmor T. Variant of imx888 from.xperia mark 5.  \r\nLYT-808 is successor of imx789.  \r\nT808 has much high light sensibility. \n",
    "Intensityblue, 26 Jan 2024In the UK at least the only reason this won't sell is because you can't get it on co... moreYou are trying to affirm your purchase, I guess. Everyone is missing out because they don't understand, and carriers are not selling it because they are stupid?\n \r\nNope, most people simply choose what they consider a better phone/value case, and most often it's a Samsung or Apple, which are comparable or close, with discounts. Google's Pixel Pro is also a better phone, and cheaper than the others.",
    "jiyen235, 26 Jan 2024hey man awesome comment and I agree, honestly I'd have upgraded from my phone to this one... moreThis screen is definitely better than the ones on the Vivo x100 pro and Iqoo 12. Lots of Chinese reviewers have measured the whole screen auto brightness over 1,600. Don't know why there is a discrepency. Maybe it was an early software build on the global version? The x100 pro and Iqoo 12 are using mixed screens from visionox and Boe. The Op12 uses the same screen as the Oppo Find x7 ultra. It's using BOE's latest and best technology ",
    "Intensityblue, 26 Jan 2024In the UK at least the only reason this won't sell is because you can't get it on co... morehey man awesome comment and I agree, honestly I'd have upgraded from my phone to this one if it were 1 year older so I'm holding on for just a year longer. After that it'd be a tough battle between the next IQOO, Oneplus and Vivo's X Pro model haha like these 3 are the current kings I think right alongside Google's spectacular Pixel 7 and 7a. GSM wrote so many positive things but gave this phone a 4.3 and I think they did Oneplus dirty, the Oneplus 11 had 4.4 stars which was a worse phone even in last year's market. This is the best phone for the most people, the S24 stands no chance, the base iPhone might win people over with Apple's processing and the Google Pixel is a solid contender but no telephoto could be a problem. I just think Oneplus could've gone with a brighter display for a lower res like the Vivo X100 Pro or the IQOO 12 but that's about it and low light video stabilisation seems to be a mess but that's about it, everything else is banger. Welcome back Oneplus, now just put the Oneplus 11's hardware onto the next year's R phone and Oneplus would cement itself as the new global GOAT.",
    "Anonymous, 25 Jan 2024Yet many of the major review sites gave lukewarm reviews to the One+ 12 Pro camera performance... moreIn the UK at least the only reason this won't sell is because you can't get it on contract from any mobile providers. \r\nBut let's be serious, you're wrong with what you say. For this money specifically, nobody is going to buy Samsung or Apple devices because they quite simply do not exist in the same price range and where they might come close, specs are substantially lower.\n \r\nThose who choose Apple will always choose Apple, it has nothing to do with anything other than the perceived value that device has to them which is more than fine. Value for money is irrelevant and I respect that even though I choose not to use Apple devices.\n \r\nFor Android owners the only Samsung device that should really  be considered ahead of this is The S24 Ultra because again, the others in there range can't compete in most areas.\n \r\nIt's a shame because from my time with the OnePlus 12 this is truly an amazing device, curved screen and all. Flat screens these days are no better and create devices which are far more angular and less comfortable to hold by any metric, especially one handed.\n \r\nThe OnePlus 12 is comfortable to hold, more.responsive than any other device I've had the pleasure to use and looks truly stunning. But nobody is ever going to understand that if they're too closed minded to give one a go. Again such a shame that mobile providers won't be carrying this device, as just holding in your hand would turn the heads of many prospective users, and that's just not going to happen as the opportunity doesn't exist.\n \r\nCameras may be less than some of the competition but sorry to disappoint you here, there actually pretty damn good, and when you're saving over 400 bucks on your device compared to the competition that's understandable. The only thing I will accept as a valid reason for not considering the device however is the lack of IP 68 protection reverting to IP 65. To be fair, the way this works, companies like OnePlus tell independent testers to check for conformity to a specific standard, and if they meet the requirements that rating is given. Yes it costs more to Get an IP 68 rating per device but OnePlus has demonstrated again and again that there devices are better than there IP rating would have you think, unfortunately given that they don\"t guarantee against water damage and it still invalidates warranties, it makes it harder to follow that logic.\n \r\nThen again water damage invalidates Samsung warranties also so maybe what we should really be looking at is companies having enough self belief in there product to back it up and unfortunately no manufacturer presently has the balls to do that, IP 68 or not.\n \r\nAt the end of the day, this phone absolutely rocks, and although some diehard Oneplus fans might prefer the old Oxygen OS, having used both that and the new ColorOS adjusted version I truly believe this is an upgrade on the softwaremfromt also.",
    "cons to add :\n \r\n. bad thermal as other SD8 gen 3 devices",
    "mr stoosh, 26 Jan 2024So I'm assuming the higher FWC figure that the OnePlus Open LYT-T808 has is technically b... moreYes, technically the sensor from OnePlus Open is way better. ",
    "Deva, 26 Jan 2024Compare the OnePlus 12 with Vivo x100 which is better.\r\nAnd I don't know why many people ... moreVivo's lack of updates and global 4G/5G bands sucks. They are good phones only in China if you don't care about updates.",
    "Compare the OnePlus 12 with Vivo x100 which is better. \r\nAnd I don't know why many people don't put interest the Vivo x series. These phones also good or not",
    "Rain, 25 Jan 2024To clarify some things: LYT-T808 sensor frome OnePlus Open is not the same as LYT-808 from OP ... moreSo I'm assuming the higher FWC figure that the OnePlus Open LYT-T808 has is technically better than the main camera used in the OnePlus 12?",
    "Rain, 25 Jan 2024To clarify some things: LYT-T808 sensor frome OnePlus Open is not the same as LYT-808 from OP ... moreThat's a really nice piece of information, I appreciate it. I didn't know they had all the numbers listed on their website.",
    "Anonymous, 25 Jan 2024Majority of their sales are surely Nord. \r\nDont think flagships even count more than maybe 2 m... more\"They can bump production of oled if necessary\" \r\nBy investing a s*** ton of money, yes. LCD is a lot simpler in terms of structure so Sharp can mass-produce these panels, but IGZO? I highly doubt it.",
    "ua82, 25 Jan 2024nice spec considering how much can get the CN version and just flash oxygen , supports the net... moreI too am not impressed with curved screens at all, if the 12 or 12r had a good flat screen even like my 8t i would definitely have got one or the other but now very undecided, maybe have to change make.",
    "Rain, 25 Jan 2024To clarify some things: LYT-T808 sensor frome OnePlus Open is not the same as LYT-808 from OP ... moreThere will still be crazy people who will claim that it is the same sensor or a similar sensor.. Even if it has half the power compared to the LYT-T808..",
    "I cant really get it , why people complain about android skins...\n \r\nSome said coloros os trash \r\nOthers said oxygen is trsh \r\nAnd so eho said one os is trash\n \r\nI have tried all of them and find no difference and all do the work great\n \r\nWhy the software is a big deal\n \r\nOr in other question\n \r\nWhy people complain about softwares if it does the works great ??",
    "Ottonis, 25 Jan 2024Recently, \"Mr. Who's the Boss\" (a popular hardware review channel on YouTube) p... moreYet many of the major review sites gave lukewarm reviews to the One+ 12 Pro camera performance, and especially to the nighttime performance. GSMA's review of the camera is a bit of an outlier and more positive than most. For the price, most will choose a Pixel, Samsung, or an iPhone. But if all you care about is the fastest chip and want to save a few pennies, then the 1+ may be in the running. But if you wait for three months, the price will probably drop by a lot, because there is little chance that this will sell without major price cuts.",
    "To clarify some things: LYT-T808 sensor frome OnePlus Open is not the same as LYT-808 from OP 12.\n \r\nYou can find crucial evidence of this on the OnePlus site. According to the information on the oneplus open site LYT-T808 has a full-well capacity (FWC) index of approximately 40,000e, which means it can absorb 40,000 electrons per pixel before becoming fully saturated.\n \r\nOn the OP 12 site, there is an information that the sensor has FWC up to 24,600.\n \r\nMain sensor in OP11 16,500 FWC.\n \r\nSo as You can see OP Open and OP12 main sensors doesn't have same capabilities.",
    "Recently, \"Mr. Who's the Boss\" (a popular hardware review channel on YouTube) posted a very enthusiastic review on the One Plus 12 praising the screen, CPU performance, cooling, overall finesse of the OS layer, and battery - with the only caveat being the camera performance that he found good but not outstanding.  \r\nAccording to this reviewer, he puts the Oppo 12 among the potential top 3 smartphones of 2024. \n \r\nSo, the overall tone of the gsmarena review is a bit more careful and a little bit sceptical when compared with that other review. The overall rating of 4.3 stars is certainly less than what other flagship phones get.\n \r\nWhile  there is no doubt that this is a hugely attractive phone, I am still wondering how it may compare in real life to the usual flagships from Samsung, Apple, Sony, Asus, or Vivo.",
    "nice spec considering how much can get the CN version and just flash oxygen , supports the network bands aswell, but think I'll wait another year wished they do away from the curved screen, ",
    "Iqoo 12 is a amazing option and with good discount on credit card . Its performance is amazing due to snapdragon gen 3 processor. ",
    "Nick Tegrataker, 25 Jan 2024There's uncertainty about how capable Sharp is in producing IGZO panels at a large scale ... moreMajority of their sales are surely Nord.  \r\nDont think flagships even count more than maybe 2 millions.  \r\nSharp was once one of suppliers of LCD of zapple and Sony.  \r\nThey can bump production of oled if necessary.  \r\nSince componets are delivered batch by batch, it is possible. ",
    "Zuzuz, 25 Jan 2024The phone is 960 on their website and you'll get some gifts along with it. Overall is bet... moreThe One+ is cheaper, but hardly better. I, like most, would choose the Samsung for the camera alone.",
    "dexton, 24 Jan 2024The 3x zoom camera of their Oneplus 12 has a lens flaw, like decentering or something. It'... moreI've bought two phones that had lens flaws in the past.  I would always return it also as it would annoy me.  However, I had great difficultly returning one of them as I bought it from  a Xiaomi offline store in China and in order to return it I needed to go to a service center and get them to certify that the phone is faulty (it can't be returned normally once the box is opened unless there is a fault).  This can be very tricky for a lens issue as usually they try to deny it and claim it's normal as the issue is not that noticeable unless you look carefully.  I had to argue for a long time to get them to agree to certify that it was faulty. Luckily for me there was a model on display so I asked the maintenance staff to compare the pictures with the display model and they could see they were different and the display model did not have the blurring on one side of the picture.  I also only buy online too direct from the manufacturer as they all have a 7 days return policy buying online so you can return it without having to get it checked for faults in a service centre.  Lens flaws are actually relatively common and now it's the first thing I check when buying a new phone. ",
    "Anonymous, 24 Jan 2024How to fix: \r\n\r\n- colorOS 🔄 oxygenOS\r\n- boe oled 🔄 sharp igzo\r\n- lyt808 🔄 lyt-t808 \r\n- imx581 ... moreThere's uncertainty about how capable Sharp is in producing IGZO panels at a large scale (i.e. They might face a yield issue), so choosing BOE over Sharp is a much safer move.",
    "wow, it has better vapor chamber than S24 ultra. A flat scr. would be perfect.",
    "Nezziak, 24 Jan 2024All in all, a really mediocre device for 1000€ in Europe.\r\nSkip it \r\nNot worth itThe phone is 960 on their website and you'll get some gifts along with it. Overall is better than S24+ which is more expensive.",
    "Anonymous, 24 Jan 2024How to fix: \r\n\r\n- colorOS 🔄 oxygenOS\r\n- boe oled 🔄 sharp igzo\r\n- lyt808 🔄 lyt-t808 \r\n- imx581 ... moreIgzi is available only in Japan and only for Sharp. Is extremely expensive and very hard to obtain a satisfactory number in production.",
    "Bob, 24 Jan 2024There is no competition at their price rangeYou are right if we consider the price range only. The fact is that people out there are comparing between OP12 and S24Ultra, based on the camera performance and the value for money aspec that make S24Ultra overpriced.",
    "Nezziak, 24 Jan 2024All in all, a really mediocre device for 1000€ in Europe.\r\nSkip it \r\nNot worth itMediocre? Compared to what in the same price range?",
    "Anonymous, 24 Jan 2024Other reviews, such as CNETs, are far less excited about the camera quality.\r\n\r\nI would not ev... moreDon't rely to much on what different reviewers say about it.\n \r\nOne will praise it because they get money from someone and others will say its crap just because they get paid from another...\n \r\nWait and see what owners have to say and also wait for some updates which often make the cameras better.",
    "The 3x zoom camera of their Oneplus 12 has a lens flaw, like decentering or something. It's on the right side of the frame, quite blurry. Can even be seen in 6x zoomed photos. \r\nHaven't seen a similar flaw in their Oneplus Open or Oppo Find N3 samples, with the same lens.\n \r\nIf I received a phone with a flawed lens like that, I would return it.\n \r\nOP12 is a nice looking phone and I like curved screen (like my S23 Ultra) but 2x photos are better on S23 Ultra. And its hard to live without the pen once you've started using it for some things.",
    "Other reviews, such as CNETs, are far less excited about the camera quality.\n \r\nI would not even consider this phone at the current asking price. But OnePlus generally loses its value much faster than the likes of Samsung and Google, and of course Apple, so at some point it can become a good buy.\n",
    "Baldilocks73, 24 Jan 2024Why are your Geekbench scores so low compared to other sites that have tested the phone? \r\n\r\nA... moreThey aren't the only ones.\n \r\nAndroid Central and Tom's also posted unusually low scores.\n \r\nI think it's maybe some kind of setting that gets triggered causing it to drop into power saving mode?  Either way GSMA is not the only ones that got weird scores.  I bet the OS is buggy (as is typical for OnePlus...)",
    "GregLu, 24 Jan 2024Considering they don't drop the price, it's not cheap.\r\nNever settle they said.\r\n\r\nW... moreafter the Oneplus 9 series, this is the best phone for the price, the price for getting into the Oneplus family might be higher but that's mostly due to a starting storage of 256 GB. That's quite the feat. I still remember being blown away by the Oneplus 8 and it was $699 for 128 GB storage, the Oneplus 12 is $799 for 256 GB storage, a sizeable but understandable uplift in price, especially taking inflation into account. This has upgraded speakers, cameras and display compared to the Oneplus 11, this is a killer phone right now. If you're really bothered about the price then why don't you take a look at the Oneplus 12R? Their R series is criminally underrated and overlooked. These phones give flagship performance for a good price, flagship killers basically. Would you really have a problem with having the SD 8 Gen 2 instead of SD 8 Gen 3? Most likely not, that's why the 12R is such a huge win imo. These phones aren't necessarily cheap but phones aren't cheap now and these are offering good value in this horribly priced market. The IQOO 12 is a better buy for me though, for as much flak IQOO phones get, they are the ones carrying Oneplus's past \"flagship killer\" spirit. Xiaomi phones are great and all but uh yk, they're Xiaomi, software is good now but others have great software so Poco phones aren't up to par. ",
    "Curved screen. When will they stop this nonsense? More likely to break, more expensive replacements, and they make the phone harder to pick up and easier to drop.\n \r\nBeen thinking I might buy this. But that curved screen is a real turn off.",
    "Why are your Geekbench scores so low compared to other sites that have tested the phone? \n \r\nAverage of other sites is: 2250 Single Core and 6765 for Multi-Core.\n \r\nMight need to rerun the tests.",
    "How to fix: \n \r\n- colorOS 🔄 oxygenOS \r\n- boe oled 🔄 sharp igzo \r\n- lyt808 🔄 lyt-t808  \r\n- imx581 🔄 imx589 ",
    "Aierlan, 23 Jan 2024The pricing is not much different than the previous generation at least in Europe. As far as I... moreConsidering they don't drop the price, it's not cheap. \r\nNever settle they said.\n \r\nWhen I saw the comparison from X7 Pro, it's obvious that OP didn't want to make the 12 the best they could with the hardware/software. Perhaps it could be improved with update ... But again, they never drop the price (Like Apple) until the next is launched.\n \r\nI was a OP fan in the past, until 5 but even then it was the start of the end. And it's no better now, don't get me wrong, it's not a bad device per se, but for the price asked, they have done more on the software side (ISP mainly, see Vivo and Oppo, it's very more clear/less blurry). In video capture too apparently.\n \r\nI wonder too if this has something to do with the agreement with Nokia that happened a few days before the OnePlus international launch. Perhaps it could have been halted somehow.",
    "The Green fake marble glitter colour is quite ugly, wish it was solid Green like 11. Maybe it looks better it person. White is the best colour and global markets don’t get it!",
    "From vietnam, I have used oneplus 12 for 3 week. I buy with the price 650$. Camera is good, especially portrait. Oxygen os is quite so so. It's better than oneplus 11",
    "All in all, a really mediocre device for 1000€ in Europe. \r\nSkip it  \r\nNot worth it",
    "IpsDisplay, 24 Jan 2024As other have said the review is a bit dry.. the software side of the review completely missed... moreThey did their usual stress test... it was nothing special",
    "Maria, 24 Jan 2024Excuse me, GSMArena, I like to remind you:\r\nI think you have to get S24Ultra as alternative, c... moreThere is no competition at their price range",
    "As other have said the review is a bit dry.. the software side of the review completely missed the X7 chipset inside the smartphone that helps with gaming/ GPU \n \r\nPixel works x7 had the  adaptive frame booster and hyper resolution options in the game menu hub...\n \r\nSometimes gsmarena review format is too rigid/ formulaic to pay attention to some newer stuff",
    "CamoGeko-XDA, 23 Jan 2024I don't think this device is priced competitively at all tbh.\r\n\r\nYou can buy Chinese mode... moreThat's a Chinese phone though with a pretty useless 2x telephoto with poor quality sensor and no OIS that is not much better than a 2x crop from the main sensor. The ultrawide is also using a very old omnivision sensor that was used as far back as the k30 pro four years ago. Also, if importing to Europe the k70 pro doesn't support key European bands so it's not a great option for Europe. You could also make the same argument for importing the Oneplus 12 for much cheaper if you really want and the Chinese Oneplus 12 supports all European bands so the signal would be more stable. In fact if you want to import you have loads of options. The global price is not cheap but it is competitive and in line with other brands like Xiaomi and Samsung ",
    "🚨🚨🚨🚨🚨🚨🚨🚨\n \r\nLooks like Oppo is paying Nokia to be able to sell in some parts of Europe again. \n\n",
    "Excuse me, GSMArena, I like to remind you: \r\nI think you have to get S24Ultra as alternative, competitor, whatever of OP12 because I knew more than one out there are supporter of OP12 and comparing this with S24Ultra.",
    "Nick Tegrataker, 24 Jan 2024Just because OP12's main sensor's pixel pitch matches the one on OP11, that doesn\u0000... moreOpen and Xperia also are 1.12 micron. Not OP11,  890/766 are 1.0. \r\nThat is my point.  \r\nThey claim 808 and T808 are \"twins\". \n\n",
    "justasmile, 24 Jan 2024$799 is quite good though.Lets just say that Oneplus12 pricing is better in the US than in Europe. \r\nAnd in the US, i am not sure how many will spend that much money for Oneplus compared to Apple or Samsung.  \r\nEven Motorola is more popular in the US if i remember right.",
    "Nick Tegrataker, 24 Jan 2024Yeah, GSMArena not mentioning the Master Mode is definitely disappointing. I hope they will ad... moreAt most gonna mention values of shutter and iso possible.  \r\nDo not expect any samples. ",
    "LoneOwl, 23 Jan 2024Things i like in Oneplus 12\r\n+crazy fast charging and charger in the box\r\n+12/256 base version... more$799 is quite good though.",
    "CamoGeko-XDA, 23 Jan 2024I don't think this device is priced competitively at all tbh.\r\n\r\nYou can buy Chinese mode... moreHalf the price, half the cameras, half the display. Surely you can't get a phone at this level with $400.",
    "Anonymous, 23 Jan 2024Extremely overpriced. Worst photos take by LYT-808!My buddy is blind 💀",
    "Alex, 23 Jan 2024The lack of real water resistance is a shame for a flagship but why such a low score when ever... moreThere is no 'real water resistance'. It's only non-water resistant, or water-resistant, which this phone is (IPX5)",
    "It's honestly a work of art.",
    "Anonymous, 24 Jan 2024Pixel pitch of 1.12 matches 789 and 888. \r\nIf OnePlus/Oppo claim 808 and T808 are equal, then ... moreJust because OP12's main sensor's pixel pitch matches the one on OP11, that doesn't mean it's been confirmed that they are using the sensor with the same resolution as the predecessor, too.",
    "who fooling  who\n \r\navoid > OS/Software: Android 14, OxygenOS 14 (International), ColorOS 14 (China). ",
    "Nick Tegrataker, 24 Jan 2024We'll have to wait for either a confirmation from OnePlus (that they use the same 52MP mu... morePixel pitch of 1.12 matches 789 and 888.  \r\nIf OnePlus/Oppo claim 808 and T808 are equal, then both share all specs except dual layer and T808 is not 2x2 ocl. \n \r\nMany comments on weibo about it being based on 789. \n \r\nDCS earlier : \" The iPhone 16 Pro Max is a flagship imaging generation. The 48Mp IMX903 custom main camera hardware is very powerful. The 1/1.14\" super outsole is equipped with double-layer transistors and is equipped with 14Bit ADC and DCG\" \n",
    "Alex, 23 Jan 2024The lack of real water resistance is a shame for a flagship but why such a low score when ever... moreI dont think everything else is on top.\n \r\nCheck the speaker loudness or the max display brightness test. \r\nEven in cameras, its nowhere close on top.\n \r\nOneplus is strong in battery(although very poor while gaming for some reason)and fast charging(alert slider and IR blaster nice bonuses)and thats it.",
    "Welp, just another large heavy phone. Boring.",
    "You could have tested it longer, we would appreciate a more detailed review even later than this fast-fermented review... \r\nWhere is endurance battery rating,Photo quality comparison,video quality comparison ? ",
    "Aierlan, 24 Jan 2024Was hoping for a bit more detail on the camera review.  It is way shorter than normal and omit... moreYeah, GSMArena not mentioning the Master Mode is definitely disappointing. I hope they will add it later and include one for an upcoming Find X7 Ultra review as well.",
    "GSMArena, will you be uploading portrait mode samples as well as the test shots in the studio comparison tool? ",
    "What a half baked review @gsmaena? Where is portrait camera samples and most importantly where is Photo compare tool ? I wanted to compare camera quality with pixel 8 and galaxy s24.",
    "Aierlan, 24 Jan 2024Was hoping for a bit more detail on the camera review.  It is way shorter than normal and omit... moreSo you missed the point they clearly told that same camera setup in other models are already reviewed so why should they do it again if its totally same what earlier models use?",
    "The review dosent seem to mention the connectivity. The lte fdd band in 12 has dropped a lot of bands support compared to op11. Obviously cost cutting i guess. And in review how it's going to give quality call quality. And support for esim option is not covered. ",
    "Aierlan, 23 Jan 2024The pricing is not much different than the previous generation at least in Europe. As far as I... moreyeah I know but it still kinda stings considering the fact that apart from Samsung, everyone is reluctant to drop prices so for every other brand what you see is what you have to pay. Like, if this phone were 800 euros or something that'd have made this a killer flagship, the main gripe I have is with the display, 100-200 USD less is necessary for a cut down display like this.",
    "Was hoping for a bit more detail on the camera review.  It is way shorter than normal and omits many usual things.  No portraits, and no information about the master mode where you can adjust things like photo sharpness and no photos or videos in the photo/video compare tool.  ",
    "Aierlan, 23 Jan 2024The 12gb 256gb version of the Oneplus 12 is the base version and is not €1049. The top version... moreOh, it seems the pricing varies according to the country. It also seems that the shittier the country, the more expensive the phone is. In my countrry the difference between top versions of 11 and 12 is 149eur. I'll pass",
    "Anonymous, 23 Jan 2024Reason sony and apple dont buy cmos with 2x2 ocl. \r\n\r\nYep. Also that's the reason why Sony's current highest-end mobile sensor, IMX989, uses dual pixel (2x1 OCL), not 2x2 OCL.",
    "Anonymous, 23 Jan 2024I mean upscale from 48 to 50. \r\nSame way some cheap phones with 8mp outout 12mp. \r\n\r\nLYT808 is... moreWe'll have to wait for either a confirmation from OnePlus (that they use the same 52MP multi-aspect sensor) or a review that provides a RAW file from this phone to say if the photos have been upscaled or not. After all, OnePlus advertises that OP12's main camera uses a 50MP sensor and that's the only official information we have right now.",
    "Damn. 1100€ for the green version. My immediate thought was \"that's too much\" 😄\n \r\nWell, let's wait for those proper pwm results and experiences",
    "Anonymous, 23 Jan 2024I think it must be some kind of software issue with their game mode or battery preservation or... moreTom's also got an unusually low score with Geekbench\n\nhttps://www.tomsguide.com/reviews/oneplus-12 \n \r\nSeems like there's just some weird interaction with Geekbench specifically, and it only happens to some reviewers",
    "Ash, 23 Jan 2024Where are portrait mode samples, GSMArena?I have the same question, too😂⁉️",
    "Anonymous, 23 Jan 2024You guys keep saying about the fast charging.\r\nWhat are you even doing that you need 30min 100... moreIt’s so funny, charging speed has nothing to do with battery life!",
    "Anonymous, 24 Jan 2024What reason did they decide stop ship with a protective case?Only certain lucky markets got a free case in the box, it wouldn't surprise me if OnePlus follows in the footsteps of most phone manufacturers with no charger no preinstalled screen protector no nothing in the box. As long as their phones are cheaper than the competition that's the most important thing I suppose.",
    "Way too much about camera nowadays on all reviews sites.  in the verdict please tell us why other phones might be better than op12 for reasons that aren't all about the camera.",
    "What reason did they decide stop ship with a protective case?",
    "SD8 gen 3 is a big failure this year : until now all new smartphones with that SoC have a bad thermal !!!",
    "Nick Tegrataker, 23 Jan 2024Yeah, the 50MP mode on Oppo is still a simple upscale from 12.5MP resolution, unfortunately. 2... moreReason sony and apple dont buy cmos with 2x2 ocl. \n\n",
    "Nick Tegrataker, 23 Jan 2024Yeah, the 50MP mode on Oppo is still a simple upscale from 12.5MP resolution, unfortunately. 2... moreI mean upscale from 48 to 50.  \r\nSame way some cheap phones with 8mp outout 12mp. \n \r\nLYT808 is successor of imx789.  Its effective res is 48 as well.  \r\nPhysically unable to use more than 48. \n \r\nWas not supposed to be 12.5/50 ",
    "jiyen235, 23 Jan 2024let me guess, you're gonna say \"the S23 Ultra has the best camera on the planet and ... moreJust see  the differencd compared with x100p in the revuew",
    "SC, 23 Jan 2024Why are the geekbench 6 single core scores muchhh lower than other reviewers? \r\nYour scores:\r\n... moreI think it must be some kind of software issue with their game mode or battery preservation or something.  Some reviewers have it on par with other SD8G3 phones, but GSMA isn't the only one that saw unusually low scores with Geekbench 6:\n\nhttps://www.androidcentral.com/phones/oneplus-12-review#section-oneplus-12-performance ",
    "is it just me thinking OnePlus will sell much more phones if making them with a flat display? ",
    "The lack of real water resistance is a shame for a flagship but why such a low score when everything else is on top?",
    "Anonymous, 23 Jan 2024You cant really compare them like that. When op11 16/256 came out it was 899eur, it was the &q... moreThe 12gb 256gb version of the Oneplus 12 is the base version and is not €1049. The top version of the Oneplus 12 is the 16gb 512gb version. In France and Spain the initial sales price for the top 16gb 512gb version is €999. ",
    "That's the smartphone I've been waiting for. Excellent battery life, bright and crisp display, fast and responsive UI, versatile cameras. Thanks for the review, I was waiting for it to make sure that would be a great choice for me. :)",
    "Anonymous, 23 Jan 2024Another rebranded Oppo....Could be excellent, if only it had another android skin than Color O... moreWhich Oppo phone did they rebrand? There is no phone with OPPO branding that has this design or these exact specs either",
    "Nick Tegrataker, 23 Jan 2024Yeah, the 50MP mode on Oppo is still a simple upscale from 12.5MP resolution, unfortunately. 2... more*the 50MP mode on OnePlus (and Oppo) is still a simple upscale",
    "Some of us would appreciate if you'd test the PWM values, instead of just citing them. And call quality, that's also lacking.:)",
    "Aierlan, 23 Jan 2024The pricing is not much different than the previous generation at least in Europe. As far as I... moreAnd inflation. ",
    "Anonymous, 23 Jan 2024For some reason, OP and Realme are doing upscale.  If other were 50, I would understand it to ... moreYeah, the 50MP mode on Oppo is still a simple upscale from 12.5MP resolution, unfortunately. 2x shots are a proper centre crop from the full resolution so it's technically still 12.5MP, but because of the 2x2 OCL design of the sensors they use, the level of detail is very low and suffers from a lot of wormy artifacts (Commonly seen on many phones that use IMX766 that also has 2x2 OCL).\n \r\nPersonally, I would say OnePlus 12's camera setup is a marked improvement from OnePlus 11 - less sharpening, less noise, overall better retention of details both during the day and night, a more neutral colour palette etc. X100 Pro and Find X7 Ultra set the bar *extremely* high in every single aspect though, and while OP12 still performs well in this regard, it's absolutely no match against the other two BBK flagship phones.",
    "Expected better results in the camera, why would they put a quad bayer 32mp in a 1k phone ? even samsung mid rangers have better sensors. ",
    "LoneOwl, 23 Jan 2024In my country from the official Oneplus store, its 80euro more expensive for Oneplus 12.\r\n\r\nAn... moreYes, last year's 256gb version had more ram. It was 919 euro though at launch based on the official Oneplus launch price (not current prices). For example, in larger European countries like Spain, Italy and France that was last year's launch price on the Oneplus website. Of course it's possible that in some European countries they could have charged a different price but that was the official European launch price they quoted at the launch last year ",
    "Where are portrait mode samples, GSMArena?",
    "SC, 23 Jan 2024Why are the geekbench 6 single core scores muchhh lower than other reviewers? \r\nYour scores:\r\n... moreThats true.\n \r\nSnap8gen3 devices in general on geekbench have over 2000 on single score and around 7000+ in multiscore(S24Ultra gets around 7200)",
    "Anonymous, 23 Jan 2024Gimmicky try at a phone that can't touch iphones as far efficiency goes. Photo/video qual... moreAnd you think the iPhone is the pinnacle of image quality?? You gotta be kidding me, right?? ",
    "SC, 23 Jan 2024Why are the geekbench 6 single core scores muchhh lower than other reviewers? \r\nYour scores:\r\n... moreso as not to make the s24 ultra look ridiculous!  They also haven't mentioned many of the other features that come with the Samsung phone!  and of course, they are sold to Samsung",
    "Anonymous, 23 Jan 2024Gimmicky try at a phone that can't touch iphones as far efficiency goes. Photo/video qual... moreFrom someone whose never held one in his hand. \r\nI have held one, albeit the Chinese variant and if your talking about photos it teaches Apple exactly how it should be done.  \r\nBefore you make throwaway statements buddy, you really need to check your facts.",
    "...., 23 Jan 2024I think the same hahaha!! This phone is ahead of the s24 ultra in many ways, I will only menti... moreYou guys keep saying about the fast charging. \r\nWhat are you even doing that you need 30min 100% charging? \r\nAlso why you dont bother by these technologies wasting the battery life?\n \r\nSuper fast charging shouldnt even be a measurement if above 25W, and i will even say that above 65W should consider as a downside of the phone",
    "Why are the geekbench 6 single core scores muchhh lower than other reviewers?  \r\nYour scores: \r\nSc: 1429 \r\nMc: 5124\n \r\nJuanBagnell (youtube) 10:55 \r\nSc: 2189 \r\nMc: 6695",
    "How god damn ugly is back of the smartphone, since OnePlus 11 their design is horrible ",
    "Just 55% score in the stress test. What is the point of top soc then i rly dont understand. Just to rise price, and soc have performance of sd 7 plus gen 2 after all. ",
    "David 040882, 23 Jan 2024The 4500nits is for HDR use cases, of course not the normal brightness you would use usually.Exactly my point. \n \r\nThis is the scenario most people dont care about(HDR content brightness marketing). Other flagships also have very high HDR brightness, but they have brighter displays than Oneplus 12. Gsmarena also mentions this on the review.\n \r\nIts not as bad as last years Oneplus 11,but it really sucks when a 2024 1000euro flagship has lower peak brightness under sun, lower even from mid range poco X6. \r\nOneplus 12 will probably have the worst brightness in 2024 from all other flagships, like they did last year with 11.\n \r\nI expected way better from Oneplus.",
    "Gimmicky try at a phone that can't touch iphones as far efficiency goes. Photo/video quality is crap also. ",
    "jiyen235, 23 Jan 2024let me guess, you're gonna say \"the S23 Ultra has the best camera on the planet and ... moreI think the same hahaha!! This phone is ahead of the s24 ultra in many ways, I will only mention 1 real fast charge!! both wired and wireless",
    "Anonymous, 23 Jan 2024Extremely overpriced. Worst photos take by LYT-808!let me guess, you're gonna say \"the S23 Ultra has the best camera on the planet and the S24 Ultra will beat everyone out of the water Samsung rulzz!!\" ",
    "The photos are all blurry on the right side of the image. Truly a big failure on OnePlus' part. Why didn't GSMArena even mention this?",
    "Extremely overpriced. Worst photos take by LYT-808!",
    "Gsmarena reader \n \r\n 😡,  why is samsung using same design?  Only chinese phones can do it . \n\n \r\n🤣🤣🤣🤣🤣🤣🤣🤣🤣",
    "ua82, 23 Jan 2024its my next phone loving the battery life with general usage, I'll buy the CN version whi... moreThat's very cheap. I've not flashed a ROM since the Galaxy S2 lol",
    "David 040882, 23 Jan 2024The brightness is 4500 nits peak, the Nord is nowhere close.Except nobody has able to even reach 3000.  \r\nDisplay Mate that awards A+ to.all phones tested, could not. \n\n",
    "David 040882, 23 Jan 2024The 4500nits is for HDR use cases, of course not the normal brightness you would use usually.Maybe he's mowing the grass or they want to burn their eyes!! There are all the trolls on this website!! I think a panel with 1600 nits of brightness is more than enough, the rest is pure marketing! nor do they work 24 hours under the sun",
    "Another rebranded Oppo....Could be excellent, if only it had another android skin than Color OS....\n \r\nSimilar Realme will do the same for less",
    "LoneOwl, 23 Jan 2024From gsmarenas reviews\r\n\r\nOneplus 12\r\n'''In the default Natural color setting, ... moreThe 4500nits is for HDR use cases, of course not the normal brightness you would use usually.",
    "Lister, 23 Jan 2024The battery life on this is nice, and it's £900 in the UK, I want to know where the catch... moreyou can get the CN version and flash oxygen , 16gb/512gb £590 inc delivery loving the battery life and at that price I'll be buying it I wouldnt pay £900 for it ",
    "jiyen235, 23 Jan 2024The display's abysmally low brightness (for being a flagship category phone) is a huge co... moreits my next phone loving the battery life with general usage, I'll buy the CN version which is big saving and just flash oxygen . if it wasnt for that I wouldnt be buying it ",
    "Aierlan, 23 Jan 2024The pricing is not much different than the previous generation at least in Europe. As far as I... moreIn my country from the official Oneplus store, its 80euro more expensive for Oneplus 12.\n \r\nAnd Oneplus 11 also had more ram for the money, 16/256 compared to Oneplus 12 version of 12/256.",
    "David 040882, 23 Jan 2024The brightness is 4500 nits peak, the Nord is nowhere close.From gsmarenas reviews\n \r\nOneplus 12 \r\n'''In the default Natural color setting, the OnePlus 12 was good for 1155nits when placed under bright light - not half bad and perfectly enough, but far from the best in the business. The fact that the OnePlus Open's result is in the same ballpark hints that OnePlus is deliberately targeting a number in that vicinity. Switching to Vivid mode yielded an extra hundred nits, for a 1,253nits result.'''\n \r\nOneplus Nord 3\n \r\n''We've completed our display test, and the OnePlus Nord 3 did great. We recorded 516 nits of maximum brightness when manually controlling it, and the impressive 1114 nits of max automatic brightness when we faced the screen with a bright light.'''\n \r\nDont fall for companies marketing people....",
    "I meant to say op12 is 12/512, no 16gb option",
    "Aierlan, 23 Jan 2024It's a €30 difference if you compare the same storage. The 256gb model of the Oneplus 11 ... moreYou cant really compare them like that. When op11 16/256 came out it was 899eur, it was the \"top\"version. There was no 512gb variant.  Op12 12/256 is 1049 right now and it is the \"top\" version. There is no 16gb version. Different ram/storage options. Compare the 2 \"top\" models, that is 149eur difference and not 30.",
    "The display's abysmally low brightness (for being a flagship category phone) is a huge con. Arguably a far greater sin than the IP65 rating, most people splash water on their phones or spill water on it more than they drown that thing. Besides, the IP rating is for clean water, not salt water, swimming pools or even contaminated drainage water, so it won't help much in those situations. What would've helped tho is a brighter display, seriously Oneplus? Dolby Vision and LTPO4 are THAT important to you? Who cares about that when the phone can't reach at least 1300 nits in 2024. I'm not saying it's dim but it should've been much better for what they promised and additionally, Realme and Vivo have so much better displays, those make this phone look cheap in comparison, especially the Iqoo 12 which is a tier below the Oneplus in pricing but reaches 1400 nits. The jump from 1200 to 1400 nits is more noticeable than the jump from FHD+ to QHD+ on this tiny ahh screen.\n \r\nThe speakers are worse than the Vivo X100 Pro and quite boomy overall. Worse than even Realme's GT5 Pro, it seems only Vivo has been able to craft really good speakers in the BBK, I think bass is cool and I love it but proper dynamics/less pumping and a good midrange/treble are more important since those are more audible.\n \r\nThe battery is a hit and a miss sort of, the gaming performance is subpar but the web browsing and video playback are close to class leading, I wonder what Oneplus and Oppo do that Vivo, Samsung, etc. don't that makes the gaming battery life so much worse? If the gaming time went up to 8 hours this'd be an extremely well rounded battery phone, charging superbly fast and still having loads of SOT.\n \r\nThe performance is my final ick, even if I were to believe that the performance is going to be better for the CPU (which im pretty sure will be true), the thermals aren't promising. The main culprit seems to be the SD 8 Gen 3 which is just as bad as the 8 Gen 1 for gpu at least, it's horrible for thermals. As days go by, I have more and more respect for Vivo's optmisation and cooling, I thought it was the case for the X90 series (after seeing golden reviewers reviews) and the phones this year just confirmed it, Vivo is BBK's king of cooling and squeezing out performance for the same heat. The IQOO 12 and the X100 Pro are better than the ROG Phone 8 in terms of passive cooling. Now either that's a great achievement or it shows Asus's downfall in quality. For how much flak the Dimensity 9300 got (admittedly I too was skeptical) the chip just seems more and more awesome as days go by. Apart from the ISP, I don't think at all that the chipset is a \"cheaper\" one than Qualcomm's one. Sustained performance matters more than peak and both are quite close between the SD 8 Gen 3 and the D 9300. I think there should be more tiers for the performance mode, as it stands the phones are good at dissipating heat in the current performance modes and a higher tier mode would be appreciated to squeeze out more performance at the cost of thermals. Of course, the current tier should be kept as well for people who don't want the best performance but also not the worst. So basically, I think the performance is more of a current gen Qualcomm problem than Oneplus's so I can let this slide.\n \r\nThe saving grace for this phone are the cameras, but only for photography and even then it's all due to Oppo lmao, the processing is superb. The S24 doesn't stand a chance against this now, better sensors across the board with supremely good processing now. The fact that GSM has to compare this phone's cameras to the X100 Pro and the Find X7 Ultra to show its weaknesses is a huge compliment actually, the X100 Pro's huge sensor is just too good, if OP 12's aperture were f/1.4 maybe it could've been closer. Additionally the Find X7 Ultra is just too good for a phone, huge-ish sensor (for a telephoto at least) and 6x native zoom combined with the banger processing is a recipe for success. The 6x photos are good at night and day, nothing crazy but good photos that are usable. UW cam is good now as well. Good job Oneplus and Oppo.\n \r\nBasically, think this phone's main shortcomings are the display, videography and the speakers for now. Videography ain't bad but it's not amazing, it's good tho at least and I'm content with that. The display is NOT as good as the competitors even from BBK themselves, QHD+ sounds cool on paper but 1400 nits look better irl, especially in very sunny conditions. The speakers should've been more clearer, better treble was necessary instead of more bass and for the loudness it provides, the dynamics are poor, everything sounds pump-ey or compressed and that's made worse by the fact that only Oneplus has this quality, Realme and Vivo provide far better sound quality, Vivo provides clarity and Realme provides the similar bass-ey sound but with better dynamics. A shame but it isn't THAT bad. The cameras are great, the battery is only adequate for gamers and great for everyone else, charging is superb, design is cool due to awesome colors. The pricing should've been a bit cheaper though, 50-100 euros cheaper would've made this far more compelling, considering the huge display shortcomings, the Xiaomi 13T pro had a similar brightness to the display too and that's a compelling argument but Vivo's IQOO 12 and the Realme GT5 Pro having so much higher brightness just makes this phone feel less desirable. I hope this is a software thing and it gets better later with an update fix or something but as it stands I think this phone is 7.5/10, a good phone that's close to being very good but not quite. The better display from IQOO or even Realme would've comfortably made this an 9/10 and better speakers would've made this an absolutely perfect 10/10 phone, even for it's relatively high price. Unfortunately life sucks and this phone isn't that great, would've upgraded from my S22U to this phone if it had a better display but as it stands I'm gonna be downgrading from 1280 nits to 1160 nits. Not a great deal due to that, cameras are better though in photography, videography may be better on the S22 U not sure, its grain makes me stay away from taking videos anyways lmao",
    "The battery life on this is nice, and it's £900 in the UK, I want to know where the catch it, ha.",
    "I don't think this device is priced competitively at all tbh.\n \r\nYou can buy Chinese models of other manufacturers on AliExpress for half the price. Xiaomi K70 Pro comes to mind.",
    "Wait a minute. My 8T can record up to 4K@60fps (max 5 minutes) and this thing can only do 4K@30fps?? Is that a joke?",
    "Pass and will so long when OPPO starts paying patents to Nokia ",
    "Anonymous, 23 Jan 2024LOL, what a joke. It costs 150€ more than than op11 when it came out. Where is that guy @justa... moreIt's a €30 difference if you compare the same storage. The 256gb model of the Oneplus 11 was €30 cheaper at €919",
    "LoneOwl, 23 Jan 2024Things i like in Oneplus 12\r\n+crazy fast charging and charger in the box\r\n+12/256 base version... moreThe brightness is 4500 nits peak, the Nord is nowhere close.",
    "Anonymous, 23 Jan 2024LOL, what a joke. It costs 150€ more than than op11 when it came out. Where is that guy @justa... moreWell, trading samsung for Boe indeed decreases prices, but: \n \r\nLyt808 costs more than imx890.  \r\nIt now has periscope.  \r\nIt has Qi charging.  \r\nBattery is 400mAh larger.  \r\nPhone is thicker,  more external materials used increase price.  \r\n8g3 is probably more expensive than 8g2.  \r\n11 has base 8GB.  \r\nUsb C 2.0 to 3.2 \n\n",
    "Anonymous, 23 Jan 2024LOL, what a joke. It costs 150€ more than than op11 when it came out. Where is that guy @justa... moreOnly European prices need to be complained about... Not for some countries like India for example, Believe it or not, the price of the OnePlus 12 is the same as the S23 FE.",
    "LOL, what a joke. It costs 150€ more than than op11 when it came out. Where is that guy @justasmile: \"the screen is cheaper to make so the phone will cost less\". Right, ever heard of corporate greed? Lower manufacturing cost results only in increased profit for the company, it never translates to lower cost of the product. What a naive guy, will never learn",
    "Phoenix , 23 Jan 2024Which version is USB?3.2 gen1",
    "rizki1, 23 Jan 2024Because it's the same price and maybe the S24 could be more expensive. What is there to d... moreGetting S24 over S24+ is because of the size.  \r\nYou cannot compare phones that are almost 2cm different. \n \r\nIphone 6 was more expensive than Z3, still it was compared against Z3 Compact.  \r\nIts only rival. \n \r\nSo, according to you if brand makes a 5\" 20:9 screen phone for $1000 it should still be compared to those 6.7\"?  🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️\n",
    "The best USP of this phone is that you get a 6.8 inch LTPO display + 8Gen 3 at the same price as base S24 or Iphone 15.\n \r\nBut this all is good if you can change your phone in Oct/Nov this year when new Pixels or Iphones arrive.\n \r\nYou will overcome the price vs features attraction in a few months and then you will be looking at Galaxy and Iphone owners with envy.",
    "Artem S. Tashkinov, 23 Jan 2024It it just me but it looks like lots of daylight photos are out of focus?\r\n\r\nAnd why the signi... moreThe pricing is not much different than the previous generation at least in Europe. As far as I remember the Oneplus 11 launched at €919 for the 256gb variant versus €949 this year. That's not a very big difference considering the updated cameras, wireless charging, new USB version and better screen. ",
    "Anonymous, 23 Jan 2024Even larger than s24+, but they compare against s24. \r\n🤦🏻‍♂️Because it's the same price and maybe the S24 could be more expensive. What is there to defend about the S24 being average because it is compact? \n \r\nAs GSMArena said S24 with OnePlus same price but in India OnePlus 12 costs 65K, S24 80K and S24+ 100K huge difference.",
    "Which version is USB?",
    "Why would anyone buy this instead of a renown company like Samsung in this price , should go for S24 instead ",
    "Even larger than s24+, but they compare against s24.  \r\n🤦🏻‍♂️",
    "It it just me but it looks like lots of daylight photos are out of focus?\n \r\nAnd why the significantly increased pricing is not listed as a con, GSM Arena? Ah, I get it, you got your samples for free.\n \r\nAnd the stereo speakers have become a lot worse than for OP11. Listen to the last song and you'll hear it right away. Another obvious con but you didn't list it as well. Actually lots of reviewers on YouTube have admitted that the new speakers are worse.\n \r\nAnd performance, what about it? It's ridiculously low even compared to the previous gen. People will be buying the phone with this broken ROM and let's hope OnePlus will fix performance in two months from now.",
    "Why didn't they release the white version of 1 tera global?",
    "For some reason, OP and Realme are doing upscale.  If other were 50, I would understand it to match resolution. But they are not. \n \r\nThe total resolution is 53MP with effective of 48MP.  \r\nImage circle cannot cover more than 48MP because it is multiaspect cmos, just like its previous version called imx789. ",
    "walkman8, 23 Jan 2024The score surely doesn't align with the tone of the review.\r\nBarely 2 flaws that aren\u0003... moreSeems strange alright. Lower score than the Oneplus 11 yet it seems from the review to be better basically in every area apart maybe from daylight video quality. Anyway, better to ignore the scores on gsmarena and just judge from the reviews",
    "It supposedly has the largest cooling surface of all current smartphones, I wonder how long it will take for the throttling to occur. For example with COD Mobile or COD Warzone. Or when recording 4K video",
    "Cruved screen again and 220g is too heavy. I really wish to buy Oneplus again but this is a dealbreaker",
    "The score surely doesn't align with the tone of the review. \r\nBarely 2 flaws that aren't really dealbreakers and you give it 4.3. \r\nHonestly, either fix the score board or ditch it altogether. ",
    "Things i like in Oneplus 12 \r\n+crazy fast charging and charger in the box \r\n+12/256 base version \r\n+improved battery life \r\n+wireless charging is back \r\n+improved cameras from Op11. \r\n+4years of OS updates and 5years of security patches\n \r\nThings i dont like on OP12 \r\n-same brightness as Oneplus Nord, way behind the flagship competition \r\n-worse sounding speakers compared to OP11 \r\n-noticable price increase(in Europe) \r\n-no IP68 for the price \r\n-i expected better benchmark stability\n \r\nI expected more from 12, especially on display brightness, performance(stability)and more aggressive pricing.",
    "Oneplus is just a middle of the road smartphone\n \r\nDoesn't Excel /lead in anything really..\n \r\nPhone is just alright...\n \r\n4.3 star arbitrary rating .. yeah I'm convinced now you automatically get higher than 4 star just because it's a flagship.. then a random 0.3 .. the cons don't matter and there is no consistency with the score "
]